Duet3D/Duet3Expansion/src/atmel/SAMD11_DFP/1.1.70/atdf/ATSAMD11D14AS.atdf
        <register name="DPLLCTRLB" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="DPLL Control B">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3" values="SYSCTRL_DPLLCTRLB__FILTER"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30" values="SYSCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="SYSCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLSTATUS" offset="0x50" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="Output Clock Ready" mask="0x2"/>
          <bitfield name="ENABLE" caption="DPLL Enable" mask="0x4"/>
          <bitfield name="DIV" caption="Divider Enable" mask="0x8"/>
        </register>
      </register-group>
      <value-group name="SYSCTRL_XOSC__GAIN">
        <value name="0" caption="2MHz" value="0x0"/>
        <value name="1" caption="4MHz" value="0x1"/>
        <value name="2" caption="8MHz" value="0x2"/>
        <value name="3" caption="16MHz" value="0x3"/>
        <value name="4" caption="30MHz" value="0x4"/>
      </value-group>
      <value-group name="SYSCTRL_OSC8M__FRANGE">
        <value name="0" caption="4 to 6MHz" value="0x0"/>
        <value name="1" caption="6 to 8MHz" value="0x1"/>
        <value name="2" caption="8 to 11MHz" value="0x2"/>
        <value name="3" caption="11 to 15MHz" value="0x3"/>
      </value-group>
      <value-group name="SYSCTRL_OSC8M__PRESC">
        <value name="0" caption="1" value="0x0"/>
        <value name="1" caption="2" value="0x1"/>
        <value name="2" caption="4" value="0x2"/>
        <value name="3" caption="8" value="0x3"/>
      </value-group>
      <value-group name="SYSCTRL_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INTERRUPT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SYSCTRL_BOD33__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1K" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2K" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4K" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8K" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16K" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32K" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV64K" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SYSCTRL_DPLLCTRLB__FILTER">
        <value name="DEFAULT" caption="Default filter mode" value="0x0"/>
        <value name="LBFILT" caption="Low bandwidth filter" value="0x1"/>
        <value name="HBFILT" caption="High bandwidth filter" value="0x2"/>
        <value name="HDFILT" caption="High damping filter" value="0x3"/>
      </value-group>
      <value-group name="SYSCTRL_DPLLCTRLB__LTIME">
        <value name="NONE" caption="Default No time-out" value="0x0"/>
        <value name="8MS" caption="8MS Time-out if no lock within 8 ms" value="0x4"/>
        <value name="9MS" caption="9MS Time-out if no lock within 9 ms" value="0x5"/>
        <value name="10MS" caption="10MS Time-out if no lock within 10 ms" value="0x6"/>
        <value name="11MS" caption="11MS Time-out if no lock within 11 ms" value="0x7"/>
      </value-group>
      <value-group name="SYSCTRL_DPLLCTRLB__REFCLK">
        <value name="REF0" caption="CLK_DPLL_REF0 clock reference" value="0x0"/>
        <value name="REF1" caption="CLK_DPLL_REF1 clock reference" value="0x1"/>
        <value name="GCLK" caption="GCLK_DPLL clock reference" value="0x2"/>
      </value-group>
    </module>
    <module name="TC" id="U2212" version="1.4.0" caption="Basic Timer Counter">
      <register-group class="union" union-tag="TC.CTRLA.MODE" name="TC" caption="Basic Timer Counter">
        <register-group name="COUNT8" name-in-module="TC_COUNT8" union-tag-value="1" offset="0"/>
        <register-group name="COUNT16" name-in-module="TC_COUNT16" union-tag-value="0" offset="0"/>
        <register-group name="COUNT32" name-in-module="TC_COUNT32" union-tag-value="2" offset="0"/>
      </register-group>
      <register-group name="TC_COUNT8" caption="Basic Timer Counter - 8-bit Counter Mode">
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="TC Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="WAVEGEN" caption="Waveform Generation Operation" mask="0x60" values="TC_CTRLA__WAVEGEN"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x3000" values="TC_CTRLA__PRESCSYNC"/>
        </register>
        <register name="READREQ" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Read Request">
          <bitfield name="ADDR" caption="Address" mask="0x1F"/>
          <bitfield name="RCONT" caption="Read Continuously" mask="0x4000"/>
          <bitfield name="RREQ" caption="Read Request" mask="0x8000"/>
        </register>
